class Fruits {
  List<String> fruits = [
    "Яблуко",
    "Банан",
    "Апельсин",
    "Груша",
    "Ананас",
    "Манго",
    "Ківі",
    "Персик",
    "Виноград",
    "Полуниця",
    "Чорниця",
    "Малина",
    "Лохина",
    "Кавун",
    "Диня",
    "Гранат",
    "Лимон",
    "Лайм"
  ];
  List<String> descriptions = [
    "Я́блуко — їстівний плід яблуні, соковитий, багатий на вітаміни та мікроелементи. Фрукт вагою 70—200 грамів, що вживається в їжу у свіжому, квашеному, печеному вигляді, є сировиною в кулінарії, у виробництві дитячого харчування, джемів, повидла, безалкогольних та алкогольних напоїв тощо.",
    "Бана́н (Musa) — рід багаторічних трав'янистих рослин родини бананових. Його батьківщиною є тропіки Південно-Східної Азії, зокрема Малайського архіпелагу, де він з давніх часів використовується дуже широко. Бананами також називають їстівні плоди цих рослин.",
    "Апельси́н або помаранча (Citrus sinensis) — вічнозелене дерево висотою до 7-12 м роду цитрус (Citrus) родини рутових (Rutaceae), невідоме у дикому вигляді, та його плоди. Батьківщина — Індія та Південно-Східна Азія.",
    "Груша — плід дерева груша звичайна (лат. Pyrus communis). Достигає в помірних широтах восени, рідше наприкінці літа. У тепліших широтах достигає швидше. Плід містить багато соку. Найчастіше форма нагадує яблуко із конусом зверху.",
    "Анана́с посівни́й, або звича́йний (Ananas comosus), — багаторічна рослина родини бромелієвих, найвідоміший представник однойменного роду. Харчова, технічна та декоративна культура.",
    "Манго індійське (Mangifera indica) — рослина родини анакардієвих (Anacardiaceae) роду манго (Mangifera). Тропічний фрукт з солодким смаком і нитчастою структурою. Колір шкірки — в червоних, жовтих і зелених тонах, колір м'якоті — жовтий. Плоди рослини називаються «манго» і належать до числа найпопулярніших в тропічних країнах фруктів.",
    "Ківі — молодий фрукт, що з'явився тільки в середині XIX століття в результаті окультурення актинідії приємної Actinidia deliciosa, ліани з роду актинідієвих садівником-аматором із Нової Зеландії Олександром Еллісоном.",
    "Пе́рсик (Prunus persica) — багаторічна рослина родини розових, споріднена з мигдалем. Вельми популярна і поширена плодова культура, яку також використовують як олійну, лікарську та декоративну.",
    "Виногра́д (Vitis) — рід рослин родини виноградових (Vitaceae). Рід містить ≈ 75 видів, які зростають у Євразії, Північній Америці й на півночі Південної Америки[1][2]. Україна є батьківщиною одного виду — виноград справжній Vitis vinifera L. Приблизно 20 видів винограду використовують для схрещування й виведення культурних сортів. Усі сорти поділяють на столові, винні та ізюмні.[3] Виноград має славу цілющого, високопоживного продукту. Його ягоди містять значну кількість легкозасвоюваних цукрів, вітаміни, мінеральні солі (кальцію, заліза, фосфору).",
    "Суни́ці, або полуни́ці (Fragária) — рід багаторічних трав'янистих рослин родини розових. Існує понад 20 видів суниць та багато гібридів і культурних сортів.",
    "Чорниця (Vaccínium) — рід вічнозелених і листопадних чагарників, напівчагарників та чагарничків (зрідка дерев, ліан) родини Вересові (Ericaceae). Більшість видів — з Північної півкулі, але деякі види трапляються і в Південній. Згідно з Plants of the World Online рід налічує 442 види.",
    "Мали́на (лат. Fructus Rubi idaei, Baccae Rubi idaei) — плід малини звичайної. За ботанічною класифікацією плід малини — не ягода, а багатокістянка. Складається з декількох десятків зрощених кістянок (плодиків з кісточками), прикріплених до білої конічної плодоніжки і зібраних навколо неї в округлу голівку. Після того як дозріває, від квітколожа відділяється легко. Колір — зазвичай червоний (малиново-червоний), також може бути білим, жовтим, рожевим. Дозрівають у липні — серпні, також бувають ремонтантні форми (які повторно цвітуть і дають плоди). У плодах 70-90 % соку, який містить цукри (в основному глюкозу і фруктозу), вільні органічні кислоти (лимонну, мурашину та ін.), пектини, азотні речовини, мінеральні солі, а також деревне волокно й насіння тощо.",
    "Лохи́на — ягоди, забарвлені в колір індиго з сизуватим нальотом. Рослина відноситься до розділу Cyanococcus роду Vaccinium. Комерційна лохина — як дика (низький кущ), так і культивована (висококущовий) — походить із Північної Америки. Високорослі сорти були завезені в Європу в 1930-х роках[1]. Тривалий час чорниця була відома як «Європейська лохина», оскільки лохина не вирощувалася в Європі до 1930-х років. Відрізнити лохину від схожої на вигляд чорниці легко, розрізавши ягоду навпіл. У лохини світло-зелена середина, в той час як у чорниці червона або фіолетова. Ягоди лохини ніжніші на смак.",
    "Каву́н звичайний[1][2], кавун (Citrúllus lanátus) — баштанна культура родини гарбузових. Вирощується в районах з великим сонячним випромінюванням. В Україні традиційним центром виробництва баштанних культур є Херсонська область, де щорічно збирається понад 50 % урожаю кавунів у країні.",
    "Ди́ня посівна́, або ди́ня звича́йна (Cucumis melo; Melo sativus)  — однорічна рослина з роду огірок і родини гарбузових (Cucurbitaceae). Харчова баштанна культура, іноді застосовується як лікарська.",
    "Грана́т (лат. Balaūsta) — плід, характерний для представників роду гранат (Punica). Українська назва походить від лат. «pomum granatum» — «зернове яблуко», далі з granum «зерно», від праіндоєврейської Gre-no — «зерно». Наукова латинська назва — від лат. balaustĭum, далі з грец. βαλαύστιον «плід граната». Гранат є плодом гранатового дерева.",
    "Лимо́н, цитри́на або лимо́нне де́рево (Citrus × limon) — штучний гібрид фруктових дерев роду цитрус (Citrus); також терміном «лимон» називають плід цього дерева. Харчова, ароматична, декоративна культура. Плоди використовуються для кулінарних цілей, в першу чергу його сік та цедра використовуються, в основному, в кулінарії та приготуванні кондитерських виробів. Лимонний сік містить від 5 % до 6 % лимонної кислоти, яка дає лимону кислий смак, і рН 2–3. Існує багато напоїв та цукерок з лимонним ароматом, в тому числі лимонад. Характерний кислий смак лимонного соку робить його ключовим інгредієнтом багатьох страв по всьому світу.",
    "Лайм (Citrus aurantiifolia або Citrus aurantifolia) — гібридний цитрус із родини рутових, що походять з Індії, генетично схожий з лимоном. Назва походить від перського لیمو (ліму)."
  ];
}
